In [1]:
#pandas ==> open source library that is used for data handling data manipulation
# data Structure of pandas ===>>
#(1) series ==> one-dimensional array , it shows only not columns name.
# (2) dataframe ===> multi-dimensional , it shows values with columns names.

#(1).series

In [2]:
import pandas as pd

In [5]:
a = pd.Series([1,42,78,990])
a

0      1
1     42
2     78
3    990
dtype: int64

In [6]:
type

type

In [8]:
type(a)

pandas.core.series.Series

In [29]:
# !pip install pandas

#dataframe

In [17]:
a1 ={
    "Emp_ID" : [101,102,103,104,105,106,107,108],
    "Name" : ['b' , 'B' , 'b', 'b' , 'b', 'b', 'b' , 'd'] ,
    "department" : ['IT' , 'CS' , 'ME' , 'CV' , 'MN' , 'FG' , 'TY' , 'RR'],
    "working_hours" : [8,9,7,8,9,9,6,6],
    "salary" : [ 34000, 40000, 220000, 40000, 60000, 800000,900000 , 80000]

}

In [20]:
type(a1)

dict

In [27]:
df = pd.DataFrame(a1)

In [30]:
df

   Emp_ID Name department  working_hours  salary
0     101    b         IT              8   34000
1     102    B         CS              9   40000
2     103    b         ME              7  220000
3     104    b         CV              8   40000
4     105    b         MN              9   60000
5     106    b         FG              9  800000
6     107    b         TY              6  900000
7     108    d         RR              6   80000

#how can we check top 5 data in a dataframe

In [32]:
df.head()

   Emp_ID Name department  working_hours  salary
0     101    b         IT              8   34000
1     102    B         CS              9   40000
2     103    b         ME              7  220000
3     104    b         CV              8   40000
4     105    b         MN              9   60000

In [34]:
df.head(2)

   Emp_ID Name department  working_hours  salary
0     101    b         IT              8   34000
1     102    B         CS              9   40000

In [35]:
#how we can check bottom 5 data?

In [37]:
df.tail()

   Emp_ID Name department  working_hours  salary
3     104    b         CV              8   40000
4     105    b         MN              9   60000
5     106    b         FG              9  800000
6     107    b         TY              6  900000
7     108    d         RR              6   80000

In [38]:
df.tail(2)

   Emp_ID Name department  working_hours  salary
6     107    b         TY              6  900000
7     108    d         RR              6   80000

In [39]:
#how we can check random indexed data? {ye kya hoti h }

In [42]:
df.sample(3)

   Emp_ID Name department  working_hours  salary
6     107    b         TY              6  900000
1     102    B         CS              9   40000
0     101    b         IT              8   34000

In [43]:
#how we can check total columns in a dataframes?

In [44]:
df.columns

Index(['Emp_ID', 'Name', 'department', 'working_hours', 'salary'], dtype='object')

how we can check overall information of a dataframe

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Emp_ID         8 non-null      int64
 1   Name           8 non-null      object
 2   department     8 non-null      object
 3   working_hours  8 non-null      int64
 4   salary         8 non-null      int64
dtypes: int64(3), object(2)
memory usage: 452.0+ bytes

In [48]:
#how can we check sataically view of our data?

In [49]:
df.describe()

          Emp_ID  working_hours         salary
count    8.00000        8.00000       8.000000
mean   104.50000        7.75000  271750.000000
std      2.44949        1.28174  362919.018909
min    101.00000        6.00000   34000.000000
25%    102.75000        6.75000   40000.000000
50%    104.50000        8.00000   70000.000000
75%    106.25000        9.00000  365000.000000
max    108.00000        9.00000  900000.000000

In [50]:
#how we can export our dataframe into local system"

In [60]:
#df.to_csv("C:\\Users\\pc\\Desktop\\rajat program\\emp_info.csv")

In [ ]:
#df.to_excel("C:\\Users\\pc\\Desktop\\rajat program\\emp_info.xlsx")

In [61]:
#how can we import our file into jupyternotebook?

In [62]:
df = pd.read_csv("C:\\Users\\pc\\Desktop\\rajat program\\emp_info.csv")

In [63]:
df

   Unnamed: 0  Emp_ID Name department  working_hours  salary
0           0     101    b         IT              8   34000
1           1     102    B         CS              9   40000
2           2     103    b         ME              7  220000
3           3     104    b         CV              8   40000
4           4     105    b         MN              9   60000
5           5     106    b         FG              9  800000
6           6     107    b         TY              6  900000
7           7     108    d         RR              6   80000